## Staging: quicksight
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

```terraform
Plan: 1 to add, 0 to change, 0 to destroy
```

<details>
<summary>Show summary</summary>

| CHANGE |               NAME               |
|--------|----------------------------------|
| add    | `aws_quicksight_data_source.rds` |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_quicksight_data_source.rds will be created
  + resource "aws_quicksight_data_source" "rds" {
      + arn            = (known after apply)
      + aws_account_id = (known after apply)
      + data_source_id = "NotificationCanadaCastaging"
      + id             = (known after apply)
      + name           = "Quicksight RDS data source"
      + tags_all       = (known after apply)
      + type           = "POSTGRESQL"

      + credentials {
          + credential_pair {
              + password = (sensitive value)
              + username = (sensitive value)
            }
        }

      + parameters {

          + rds {
              + database    = "NotificationCanadaCastaging"
              + instance_id = "id"
            }
        }

      + vpc_connection_properties {
          + vpc_connection_arn = "arn:aws:quicksight:ca-central-1:239043911459:vpcConnection/vpc-097508d1f5e243195"
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_iam_policy.quicksight-rds"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_policy.quicksight_vpc_connection_ec2"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_policy.quicksight_vpc_connection_iam"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_role.quicksight"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_role.vpc_connection_role"]
WARN - plan.json - main - Missing Common Tags: ["aws_quicksight_data_source.rds"]
WARN - plan.json - main - Missing Common Tags: ["aws_quicksight_vpc_connection.rds"]

24 tests, 17 passed, 7 warnings, 0 failures, 0 exceptions

```

</details>
